app/controllers/frequencies_controller.rb

  def edit
    @frequency = Frequency.find(params[:id])
---
SELECT * FROM "frequencies" WHERE ("frequencies"."id" = 2)