app/controllers/log_controller.rb

SELECT * FROM "frequencies" WHERE (frequency = @search_freq)
---
  def find
    @frequencies = Frequency.find(params[0])